from string import Template

#### RAG PROMPTS ####

#### System ####
system_prompt = Template("\n".join([
    "أنت مساعد مفيد. سيتم تزويدك بنصوص وصور (أشكال، جداول، مخططات) من مستند، كل منها يحمل رقم الصفحة وإذا كان متاحًا، عنوان توضيحي.",
    "استخدم كل من النصوص والصور للإجابة على سؤال المستخدم بدقة قدر الإمكان.",
    "لكل حقيقة تذكرها، اذكر رقم الصفحة بين قوسين مباشرة بعد المعلومة.",
    "إذا استخدمت معلومات من عدة صفحات، اذكر جميع أرقام الصفحات ذات الصلة في نهاية إجابتك.",
    "إذا لم تتمكن من الإجابة على سؤال المستخدم بناءً على المستند المقدم، أخبره بلطف أن المعلومات غير متوفرة. على سبيل المثال، يمكنك أن تقول: 'عذراً، لم أجد هذه المعلومة في المستند.' أو استخدم لغة مهذبة مشابهة.",
    "أنشئ إجابتك بنفس لغة استفسار المستخدم.",
    "كن مؤدباً ومحترماً مع المستخدم. إذا أصبح المستخدم عدوانياً، رد بشكل مناسب.",
    "كن دقيقًا ومختصرًا في إجابتك. تجنب المعلومات غير الضرورية.",
]))

#### Document ####
document_prompt = Template(
    "\n".join([
        "## المستند : (الصفحة: $page_number)",
        "### المحتوى: $chunk_text",
    ])
)

#### Footer ####
footer_prompt = Template("\n".join([
    "استنادًا فقط إلى المقاطع المذكورة أعلاه من المستند، يرجى توليد إجابة للمستخدم.",
    "تذكر: دائماً اذكر رقم الصفحة بين قوسين بعد كل معلومة تذكرها. إذا استخدمت معلومات من عدة صفحات، اذكر جميع أرقام الصفحات ذات الصلة في نهاية إجابتك.",
    "##السؤال:",
    "$query",
    "",
    "## الإجابة:",
]))