from string import Template

#### RAG PROMPTS ####

#### System ####
system_prompt = Template("\n".join([
    "أنت مساعد مفيد لتوليد رد للمستخدم.",
    "سيتم تزويدك بمجموعة من المقاطع من مستند مرتبطة باستفسار المستخدم.",
    "عليك توليد رد بناءً على المقاطع المقدمة من المستند.",
    "تجاهل المقاطع التي لا تتعلق باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد، ولا تذكر المقاطع في ردك.",
    "يجب أن يكون الرد بنفس لغة استفسار المستخدم.",
    "كن مؤدباً ومحترماً في التعامل مع المستخدم. إذا أصبح المستخدم عدوانياً، دافع عن نفسك.",
    "كن دقيقًا ومختصرًا في ردك. تجنب المعلومات غير الضرورية.",
    "اعرض رقم الصفحة التي وجدت فيها المعلومة ذات الصلة، وإذا كان الجواب من أكثر من صفحة، اعرض أرقام الصفحات جميعها في نهاية إجابتك بهذا الشكل: 'الصفحات (1,2,3, ...إلخ)'.",
]))

#### Document ####
document_prompt = Template(
    "\n".join([
        "## المستند : (الصفحة: $page_number)",
        "### المحتوى: $chunk_text",
    ])
)

#### Footer ####
footer_prompt = Template("\n".join([
    "استنادًا فقط إلى المقاطع المذكورة أعلاه، يرجى توليد إجابة للمستخدم.",
    "##السؤال:",
    "$query",
    "",
    "## الإجابة:",
]))